src/bsl/InformationRegisters/гкс_СписокСюрвейеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СписокСюрвейеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сюрвейер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СписокСюрвейеров/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Функция ПрочитатьДанныеИзРегистра(ДокументПеревозки) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	гкс_СписокСюрвейеров.Номер КАК Номер,
	               |	гкс_СписокСюрвейеров.Сюрвейер КАК Сюрвейер,
	               |	гкс_СписокСюрвейеров.Отказ КАК Отказ,
	               |	гкс_СписокСюрвейеров.Примечание КАК Примечание,
	               |	гкс_СписокСюрвейеров.ДокументПеревозки
	               |ИЗ
	               |	РегистрСведений.гкс_СписокСюрвейеров КАК гкс_СписокСюрвейеров
	               |ГДЕ
	               |	гкс_СписокСюрвейеров.ДокументПеревозки = &ДокументПеревозки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	Запрос.УстановитьПараметр("ДокументПеревозки", ДокументПеревозки);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить();
	КонецЕсли;	
КонецФункции	

Процедура ЗаписатьДанныеВРегистр(ДокументПеревозки, ТаблицаДанных)  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Набор = РегистрыСведений.гкс_СписокСюрвейеров.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументПеревозки.Установить(ДокументПеревозки);
	Набор.Прочитать();
	Набор.Загрузить(ТаблицаДанных);
	Набор.Записать(Истина);
КонецПроцедуры	
#КонецОбласти
